Revit 2026 API

# WaterWaterType Property

---

The property labeled "Type" from the "Water" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WaterType { get; }
```
```vb
Public Shared ReadOnly Property WaterType As String
	Get
```
```cpp
public:
static property String^ WaterType {
	String^ get ();
}
```
```fsharp
static member WaterType : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "WaterType".

#### Reference

Water Class

Autodesk.Revit.DB.Visual Namespace